zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/bscif.h
/**
 * \file
 *
 * \brief Component description for BSCIF
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_BSCIF_COMPONENT_
#define _SAM4L_BSCIF_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR BSCIF */
/* ========================================================================== */
/** \addtogroup SAM4L_BSCIF Backup System Control Interface */
/*@{*/

#define BSCIF_
#define REV_BSCIF                   0x100

/* -------- BSCIF_IER : (BSCIF Offset: 0x000) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC32RDY:1;       /*!< bit:      0  32kHz Oscillator Ready             */
    uint32_t RC32KRDY:1;       /*!< bit:      1  32kHz RC Oscillator Ready          */
    uint32_t RC32KLOCK:1;      /*!< bit:      2  32kHz RC Oscillator Lock           */
    uint32_t RC32KREFE:1;      /*!< bit:      3  32kHz RC Oscillator Reference Error */
    uint32_t RC32KSAT:1;       /*!< bit:      4  32kHz RC Oscillator Saturation     */
    uint32_t BOD33DET:1;       /*!< bit:      5  BOD33 Detected                     */
    uint32_t BOD18DET:1;       /*!< bit:      6  BOD18 Detected                     */
    uint32_t BOD33SYNRDY:1;    /*!< bit:      7  BOD33 Synchronization Ready        */
    uint32_t BOD18SYNRDY:1;    /*!< bit:      8  BOD18 Synchronization Ready        */
    uint32_t SSWRDY:1;         /*!< bit:      9  VREG Stop Switching Ready          */
    uint32_t VREGOK:1;         /*!< bit:     10  Main VREG OK                       */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t LPBGRDY:1;        /*!< bit:     12  Low Power Bandgap Voltage Reference Ready */
    uint32_t :18;              /*!< bit: 13..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_IER_OFFSET            0x000        /**< \brief (BSCIF_IER offset) Interrupt Enable Register */
#define BSCIF_IER_RESETVALUE        _U_(0x00000000); /**< \brief (BSCIF_IER reset_value) Interrupt Enable Register */

#define BSCIF_IER_OSC32RDY_Pos      0            /**< \brief (BSCIF_IER) 32kHz Oscillator Ready */
#define BSCIF_IER_OSC32RDY          (_U_(0x1) << BSCIF_IER_OSC32RDY_Pos)
#define BSCIF_IER_RC32KRDY_Pos      1            /**< \brief (BSCIF_IER) 32kHz RC Oscillator Ready */
#define BSCIF_IER_RC32KRDY          (_U_(0x1) << BSCIF_IER_RC32KRDY_Pos)
#define BSCIF_IER_RC32KLOCK_Pos     2            /**< \brief (BSCIF_IER) 32kHz RC Oscillator Lock */
#define BSCIF_IER_RC32KLOCK         (_U_(0x1) << BSCIF_IER_RC32KLOCK_Pos)
#define BSCIF_IER_RC32KREFE_Pos     3            /**< \brief (BSCIF_IER) 32kHz RC Oscillator Reference Error */
#define BSCIF_IER_RC32KREFE         (_U_(0x1) << BSCIF_IER_RC32KREFE_Pos)
#define BSCIF_IER_RC32KSAT_Pos      4            /**< \brief (BSCIF_IER) 32kHz RC Oscillator Saturation */
#define BSCIF_IER_RC32KSAT          (_U_(0x1) << BSCIF_IER_RC32KSAT_Pos)
#define BSCIF_IER_BOD33DET_Pos      5            /**< \brief (BSCIF_IER) BOD33 Detected */
#define BSCIF_IER_BOD33DET          (_U_(0x1) << BSCIF_IER_BOD33DET_Pos)
#define BSCIF_IER_BOD18DET_Pos      6            /**< \brief (BSCIF_IER) BOD18 Detected */
#define BSCIF_IER_BOD18DET          (_U_(0x1) << BSCIF_IER_BOD18DET_Pos)
#define BSCIF_IER_BOD33SYNRDY_Pos   7            /**< \brief (BSCIF_IER) BOD33 Synchronization Ready */
#define BSCIF_IER_BOD33SYNRDY       (_U_(0x1) << BSCIF_IER_BOD33SYNRDY_Pos)
#define BSCIF_IER_BOD18SYNRDY_Pos   8            /**< \brief (BSCIF_IER) BOD18 Synchronization Ready */
#define BSCIF_IER_BOD18SYNRDY       (_U_(0x1) << BSCIF_IER_BOD18SYNRDY_Pos)
#define BSCIF_IER_SSWRDY_Pos        9            /**< \brief (BSCIF_IER) VREG Stop Switching Ready */
#define BSCIF_IER_SSWRDY            (_U_(0x1) << BSCIF_IER_SSWRDY_Pos)
#define BSCIF_IER_VREGOK_Pos        10           /**< \brief (BSCIF_IER) Main VREG OK */
#define BSCIF_IER_VREGOK            (_U_(0x1) << BSCIF_IER_VREGOK_Pos)
#define BSCIF_IER_LPBGRDY_Pos       12           /**< \brief (BSCIF_IER) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_IER_LPBGRDY           (_U_(0x1) << BSCIF_IER_LPBGRDY_Pos)
#define BSCIF_IER_AE_Pos            31           /**< \brief (BSCIF_IER) Access Error */
#define BSCIF_IER_AE                (_U_(0x1) << BSCIF_IER_AE_Pos)
#define BSCIF_IER_MASK              _U_(0x800017FF) /**< \brief (BSCIF_IER) MASK Register */

/* -------- BSCIF_IDR : (BSCIF Offset: 0x004) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC32RDY:1;       /*!< bit:      0  32kHz Oscillator Ready             */
    uint32_t RC32KRDY:1;       /*!< bit:      1  32kHz RC Oscillator Ready          */
    uint32_t RC32KLOCK:1;      /*!< bit:      2  32kHz RC Oscillator Lock           */
    uint32_t RC32KREFE:1;      /*!< bit:      3  32kHz RC Oscillator Reference Error */
    uint32_t RC32KSAT:1;       /*!< bit:      4  32kHz RC Oscillator Saturation     */
    uint32_t BOD33DET:1;       /*!< bit:      5  BOD33 Detected                     */
    uint32_t BOD18DET:1;       /*!< bit:      6  BOD18 Detected                     */
    uint32_t BOD33SYNRDY:1;    /*!< bit:      7  BOD33 Synchronization Ready        */
    uint32_t BOD18SYNRDY:1;    /*!< bit:      8  BOD18 Synchronization Ready        */
    uint32_t SSWRDY:1;         /*!< bit:      9  VREG Stop Switching Ready          */
    uint32_t VREGOK:1;         /*!< bit:     10  Mai n VREG OK                      */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t LPBGRDY:1;        /*!< bit:     12  Low Power Bandgap Voltage Reference Ready */
    uint32_t :18;              /*!< bit: 13..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_IDR_OFFSET            0x004        /**< \brief (BSCIF_IDR offset) Interrupt Disable Register */
#define BSCIF_IDR_RESETVALUE        _U_(0x00000000); /**< \brief (BSCIF_IDR reset_value) Interrupt Disable Register */

#define BSCIF_IDR_OSC32RDY_Pos      0            /**< \brief (BSCIF_IDR) 32kHz Oscillator Ready */
#define BSCIF_IDR_OSC32RDY          (_U_(0x1) << BSCIF_IDR_OSC32RDY_Pos)
#define BSCIF_IDR_RC32KRDY_Pos      1            /**< \brief (BSCIF_IDR) 32kHz RC Oscillator Ready */
#define BSCIF_IDR_RC32KRDY          (_U_(0x1) << BSCIF_IDR_RC32KRDY_Pos)
#define BSCIF_IDR_RC32KLOCK_Pos     2            /**< \brief (BSCIF_IDR) 32kHz RC Oscillator Lock */
#define BSCIF_IDR_RC32KLOCK         (_U_(0x1) << BSCIF_IDR_RC32KLOCK_Pos)
#define BSCIF_IDR_RC32KREFE_Pos     3            /**< \brief (BSCIF_IDR) 32kHz RC Oscillator Reference Error */
#define BSCIF_IDR_RC32KREFE         (_U_(0x1) << BSCIF_IDR_RC32KREFE_Pos)
#define BSCIF_IDR_RC32KSAT_Pos      4            /**< \brief (BSCIF_IDR) 32kHz RC Oscillator Saturation */
#define BSCIF_IDR_RC32KSAT          (_U_(0x1) << BSCIF_IDR_RC32KSAT_Pos)
#define BSCIF_IDR_BOD33DET_Pos      5            /**< \brief (BSCIF_IDR) BOD33 Detected */
#define BSCIF_IDR_BOD33DET          (_U_(0x1) << BSCIF_IDR_BOD33DET_Pos)
#define BSCIF_IDR_BOD18DET_Pos      6            /**< \brief (BSCIF_IDR) BOD18 Detected */
#define BSCIF_IDR_BOD18DET          (_U_(0x1) << BSCIF_IDR_BOD18DET_Pos)
#define BSCIF_IDR_BOD33SYNRDY_Pos   7            /**< \brief (BSCIF_IDR) BOD33 Synchronization Ready */
#define BSCIF_IDR_BOD33SYNRDY       (_U_(0x1) << BSCIF_IDR_BOD33SYNRDY_Pos)
#define BSCIF_IDR_BOD18SYNRDY_Pos   8            /**< \brief (BSCIF_IDR) BOD18 Synchronization Ready */
#define BSCIF_IDR_BOD18SYNRDY       (_U_(0x1) << BSCIF_IDR_BOD18SYNRDY_Pos)
#define BSCIF_IDR_SSWRDY_Pos        9            /**< \brief (BSCIF_IDR) VREG Stop Switching Ready */
#define BSCIF_IDR_SSWRDY            (_U_(0x1) << BSCIF_IDR_SSWRDY_Pos)
#define BSCIF_IDR_VREGOK_Pos        10           /**< \brief (BSCIF_IDR) Mai n VREG OK */
#define BSCIF_IDR_VREGOK            (_U_(0x1) << BSCIF_IDR_VREGOK_Pos)
#define BSCIF_IDR_LPBGRDY_Pos       12           /**< \brief (BSCIF_IDR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_IDR_LPBGRDY           (_U_(0x1) << BSCIF_IDR_LPBGRDY_Pos)
#define BSCIF_IDR_AE_Pos            31           /**< \brief (BSCIF_IDR) Access Error */
#define BSCIF_IDR_AE                (_U_(0x1) << BSCIF_IDR_AE_Pos)
#define BSCIF_IDR_MASK              _U_(0x800017FF) /**< \brief (BSCIF_IDR) MASK Register */

