zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/bscif.h
#define BSCIF_UNLOCK_OFFSET         0x018        /**< \brief (BSCIF_UNLOCK offset) Unlock Register */
#define BSCIF_UNLOCK_RESETVALUE     _U_(0x00000000); /**< \brief (BSCIF_UNLOCK reset_value) Unlock Register */

#define BSCIF_UNLOCK_ADDR_Pos       0            /**< \brief (BSCIF_UNLOCK) Unlock Address */
#define BSCIF_UNLOCK_ADDR_Msk       (_U_(0x3FF) << BSCIF_UNLOCK_ADDR_Pos)
#define BSCIF_UNLOCK_ADDR(value)    (BSCIF_UNLOCK_ADDR_Msk & ((value) << BSCIF_UNLOCK_ADDR_Pos))
#define BSCIF_UNLOCK_KEY_Pos        24           /**< \brief (BSCIF_UNLOCK) Unlock Key */
#define BSCIF_UNLOCK_KEY_Msk        (_U_(0xFF) << BSCIF_UNLOCK_KEY_Pos)
#define BSCIF_UNLOCK_KEY(value)     (BSCIF_UNLOCK_KEY_Msk & ((value) << BSCIF_UNLOCK_KEY_Pos))
#define   BSCIF_UNLOCK_KEY_VALID_Val      _U_(0xAA)   /**< \brief (BSCIF_UNLOCK) Valid Key to Unlock register */
#define BSCIF_UNLOCK_KEY_VALID      (BSCIF_UNLOCK_KEY_VALID_Val    << BSCIF_UNLOCK_KEY_Pos)
#define BSCIF_UNLOCK_MASK           _U_(0xFF0003FF) /**< \brief (BSCIF_UNLOCK) MASK Register */

/* -------- BSCIF_CSCR : (BSCIF Offset: 0x01C) (R/W 32) Chip Specific Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_CSCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_CSCR_OFFSET           0x01C        /**< \brief (BSCIF_CSCR offset) Chip Specific Configuration Register */
#define BSCIF_CSCR_RESETVALUE       _U_(0x00000000); /**< \brief (BSCIF_CSCR reset_value) Chip Specific Configuration Register */

#define BSCIF_CSCR_MASK             _U_(0x00000000) /**< \brief (BSCIF_CSCR) MASK Register */

/* -------- BSCIF_OSCCTRL32 : (BSCIF Offset: 0x020) (R/W 32) Oscillator 32 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC32EN:1;        /*!< bit:      0  32 KHz Oscillator Enable           */
    uint32_t PINSEL:1;         /*!< bit:      1  Pins Select                        */
    uint32_t EN32K:1;          /*!< bit:      2  32 KHz output Enable               */
    uint32_t EN1K:1;           /*!< bit:      3  1 KHz output Enable                */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t MODE:3;           /*!< bit:  8..10  Oscillator Mode                    */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t SELCURR:4;        /*!< bit: 12..15  Current selection                  */
    uint32_t STARTUP:3;        /*!< bit: 16..18  Oscillator Start-up Time           */
    uint32_t :13;              /*!< bit: 19..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_OSCCTRL32_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_OSCCTRL32_OFFSET      0x020        /**< \brief (BSCIF_OSCCTRL32 offset) Oscillator 32 Control Register */
#define BSCIF_OSCCTRL32_RESETVALUE  _U_(0x00000004); /**< \brief (BSCIF_OSCCTRL32 reset_value) Oscillator 32 Control Register */

#define BSCIF_OSCCTRL32_OSC32EN_Pos 0            /**< \brief (BSCIF_OSCCTRL32) 32 KHz Oscillator Enable */
#define BSCIF_OSCCTRL32_OSC32EN     (_U_(0x1) << BSCIF_OSCCTRL32_OSC32EN_Pos)
#define BSCIF_OSCCTRL32_PINSEL_Pos  1            /**< \brief (BSCIF_OSCCTRL32) Pins Select */
#define BSCIF_OSCCTRL32_PINSEL      (_U_(0x1) << BSCIF_OSCCTRL32_PINSEL_Pos)
#define BSCIF_OSCCTRL32_EN32K_Pos   2            /**< \brief (BSCIF_OSCCTRL32) 32 KHz output Enable */
#define BSCIF_OSCCTRL32_EN32K       (_U_(0x1) << BSCIF_OSCCTRL32_EN32K_Pos)
#define BSCIF_OSCCTRL32_EN1K_Pos    3            /**< \brief (BSCIF_OSCCTRL32) 1 KHz output Enable */
#define BSCIF_OSCCTRL32_EN1K        (_U_(0x1) << BSCIF_OSCCTRL32_EN1K_Pos)
#define BSCIF_OSCCTRL32_MODE_Pos    8            /**< \brief (BSCIF_OSCCTRL32) Oscillator Mode */
#define BSCIF_OSCCTRL32_MODE_Msk    (_U_(0x7) << BSCIF_OSCCTRL32_MODE_Pos)
#define BSCIF_OSCCTRL32_MODE(value) (BSCIF_OSCCTRL32_MODE_Msk & ((value) << BSCIF_OSCCTRL32_MODE_Pos))
#define BSCIF_OSCCTRL32_SELCURR_Pos 12           /**< \brief (BSCIF_OSCCTRL32) Current selection */
#define BSCIF_OSCCTRL32_SELCURR_Msk (_U_(0xF) << BSCIF_OSCCTRL32_SELCURR_Pos)
#define BSCIF_OSCCTRL32_SELCURR(value) (BSCIF_OSCCTRL32_SELCURR_Msk & ((value) << BSCIF_OSCCTRL32_SELCURR_Pos))
#define BSCIF_OSCCTRL32_STARTUP_Pos 16           /**< \brief (BSCIF_OSCCTRL32) Oscillator Start-up Time */
#define BSCIF_OSCCTRL32_STARTUP_Msk (_U_(0x7) << BSCIF_OSCCTRL32_STARTUP_Pos)
#define BSCIF_OSCCTRL32_STARTUP(value) (BSCIF_OSCCTRL32_STARTUP_Msk & ((value) << BSCIF_OSCCTRL32_STARTUP_Pos))
#define BSCIF_OSCCTRL32_MASK        _U_(0x0007F70F) /**< \brief (BSCIF_OSCCTRL32) MASK Register */

/* -------- BSCIF_RC32KCR : (BSCIF Offset: 0x024) (R/W 32) 32 kHz RC Oscillator Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Enable as Generic clock source     */
    uint32_t TCEN:1;           /*!< bit:      1  Temperature Compensation Enable    */
    uint32_t EN32K:1;          /*!< bit:      2  Enable 32 KHz output               */
    uint32_t EN1K:1;           /*!< bit:      3  Enable 1 kHz output                */
    uint32_t MODE:1;           /*!< bit:      4  Mode Selection                     */
    uint32_t REF:1;            /*!< bit:      5  Reference select                   */
    uint32_t :1;               /*!< bit:      6  Reserved                           */
    uint32_t FCD:1;            /*!< bit:      7  Flash calibration done             */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_RC32KCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_RC32KCR_OFFSET        0x024        /**< \brief (BSCIF_RC32KCR offset) 32 kHz RC Oscillator Control Register */
#define BSCIF_RC32KCR_RESETVALUE    _U_(0x00000000); /**< \brief (BSCIF_RC32KCR reset_value) 32 kHz RC Oscillator Control Register */

#define BSCIF_RC32KCR_EN_Pos        0            /**< \brief (BSCIF_RC32KCR) Enable as Generic clock source */
#define BSCIF_RC32KCR_EN            (_U_(0x1) << BSCIF_RC32KCR_EN_Pos)
#define BSCIF_RC32KCR_TCEN_Pos      1            /**< \brief (BSCIF_RC32KCR) Temperature Compensation Enable */
#define BSCIF_RC32KCR_TCEN          (_U_(0x1) << BSCIF_RC32KCR_TCEN_Pos)
#define BSCIF_RC32KCR_EN32K_Pos     2            /**< \brief (BSCIF_RC32KCR) Enable 32 KHz output */
#define BSCIF_RC32KCR_EN32K         (_U_(0x1) << BSCIF_RC32KCR_EN32K_Pos)
#define BSCIF_RC32KCR_EN1K_Pos      3            /**< \brief (BSCIF_RC32KCR) Enable 1 kHz output */
#define BSCIF_RC32KCR_EN1K          (_U_(0x1) << BSCIF_RC32KCR_EN1K_Pos)
#define BSCIF_RC32KCR_MODE_Pos      4            /**< \brief (BSCIF_RC32KCR) Mode Selection */
#define BSCIF_RC32KCR_MODE          (_U_(0x1) << BSCIF_RC32KCR_MODE_Pos)
#define BSCIF_RC32KCR_REF_Pos       5            /**< \brief (BSCIF_RC32KCR) Reference select */
#define BSCIF_RC32KCR_REF           (_U_(0x1) << BSCIF_RC32KCR_REF_Pos)
#define BSCIF_RC32KCR_FCD_Pos       7            /**< \brief (BSCIF_RC32KCR) Flash calibration done */
#define BSCIF_RC32KCR_FCD           (_U_(0x1) << BSCIF_RC32KCR_FCD_Pos)
#define BSCIF_RC32KCR_MASK          _U_(0x000000BF) /**< \brief (BSCIF_RC32KCR) MASK Register */

