zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/bscif.h
/* -------- BSCIF_RC32KTUNE : (BSCIF Offset: 0x028) (R/W 32) 32kHz RC Oscillator Tuning Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FINE:6;           /*!< bit:  0.. 5  Fine value                         */
    uint32_t :10;              /*!< bit:  6..15  Reserved                           */
    uint32_t COARSE:7;         /*!< bit: 16..22  Coarse Value                       */
    uint32_t :9;               /*!< bit: 23..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_RC32KTUNE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_RC32KTUNE_OFFSET      0x028        /**< \brief (BSCIF_RC32KTUNE offset) 32kHz RC Oscillator Tuning Register */
#define BSCIF_RC32KTUNE_RESETVALUE  _U_(0x00000000); /**< \brief (BSCIF_RC32KTUNE reset_value) 32kHz RC Oscillator Tuning Register */

#define BSCIF_RC32KTUNE_FINE_Pos    0            /**< \brief (BSCIF_RC32KTUNE) Fine value */
#define BSCIF_RC32KTUNE_FINE_Msk    (_U_(0x3F) << BSCIF_RC32KTUNE_FINE_Pos)
#define BSCIF_RC32KTUNE_FINE(value) (BSCIF_RC32KTUNE_FINE_Msk & ((value) << BSCIF_RC32KTUNE_FINE_Pos))
#define BSCIF_RC32KTUNE_COARSE_Pos  16           /**< \brief (BSCIF_RC32KTUNE) Coarse Value */
#define BSCIF_RC32KTUNE_COARSE_Msk  (_U_(0x7F) << BSCIF_RC32KTUNE_COARSE_Pos)
#define BSCIF_RC32KTUNE_COARSE(value) (BSCIF_RC32KTUNE_COARSE_Msk & ((value) << BSCIF_RC32KTUNE_COARSE_Pos))
#define BSCIF_RC32KTUNE_MASK        _U_(0x007F003F) /**< \brief (BSCIF_RC32KTUNE) MASK Register */

/* -------- BSCIF_BOD33CTRL : (BSCIF Offset: 0x02C) (R/W 32) BOD33 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Enable                             */
    uint32_t HYST:1;           /*!< bit:      1  BOD Hysteresis                     */
    uint32_t :6;               /*!< bit:  2.. 7  Reserved                           */
    uint32_t ACTION:2;         /*!< bit:  8.. 9  Action                             */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t MODE:1;           /*!< bit:     16  Operation modes                    */
    uint32_t :13;              /*!< bit: 17..29  Reserved                           */
    uint32_t FCD:1;            /*!< bit:     30  BOD Fuse Calibration Done          */
    uint32_t SFV:1;            /*!< bit:     31  BOD Control Register Store Final Value */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BOD33CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_BOD33CTRL_OFFSET      0x02C        /**< \brief (BSCIF_BOD33CTRL offset) BOD33 Control Register */

#define BSCIF_BOD33CTRL_EN_Pos      0            /**< \brief (BSCIF_BOD33CTRL) Enable */
#define BSCIF_BOD33CTRL_EN          (_U_(0x1) << BSCIF_BOD33CTRL_EN_Pos)
#define BSCIF_BOD33CTRL_HYST_Pos    1            /**< \brief (BSCIF_BOD33CTRL) BOD Hysteresis */
#define BSCIF_BOD33CTRL_HYST        (_U_(0x1) << BSCIF_BOD33CTRL_HYST_Pos)
#define BSCIF_BOD33CTRL_ACTION_Pos  8            /**< \brief (BSCIF_BOD33CTRL) Action */
#define BSCIF_BOD33CTRL_ACTION_Msk  (_U_(0x3) << BSCIF_BOD33CTRL_ACTION_Pos)
#define BSCIF_BOD33CTRL_ACTION(value) (BSCIF_BOD33CTRL_ACTION_Msk & ((value) << BSCIF_BOD33CTRL_ACTION_Pos))
#define BSCIF_BOD33CTRL_MODE_Pos    16           /**< \brief (BSCIF_BOD33CTRL) Operation modes */
#define BSCIF_BOD33CTRL_MODE        (_U_(0x1) << BSCIF_BOD33CTRL_MODE_Pos)
#define BSCIF_BOD33CTRL_FCD_Pos     30           /**< \brief (BSCIF_BOD33CTRL) BOD Fuse Calibration Done */
#define BSCIF_BOD33CTRL_FCD         (_U_(0x1) << BSCIF_BOD33CTRL_FCD_Pos)
#define BSCIF_BOD33CTRL_SFV_Pos     31           /**< \brief (BSCIF_BOD33CTRL) BOD Control Register Store Final Value */
#define BSCIF_BOD33CTRL_SFV         (_U_(0x1) << BSCIF_BOD33CTRL_SFV_Pos)
#define BSCIF_BOD33CTRL_MASK        _U_(0xC0010303) /**< \brief (BSCIF_BOD33CTRL) MASK Register */

/* -------- BSCIF_BOD33LEVEL : (BSCIF Offset: 0x030) (R/W 32) BOD33 Level Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VAL:6;            /*!< bit:  0.. 5  BOD Value                          */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BOD33LEVEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_BOD33LEVEL_OFFSET     0x030        /**< \brief (BSCIF_BOD33LEVEL offset) BOD33 Level Register */
#define BSCIF_BOD33LEVEL_RESETVALUE _U_(0x00000000); /**< \brief (BSCIF_BOD33LEVEL reset_value) BOD33 Level Register */

#define BSCIF_BOD33LEVEL_VAL_Pos    0            /**< \brief (BSCIF_BOD33LEVEL) BOD Value */
#define BSCIF_BOD33LEVEL_VAL_Msk    (_U_(0x3F) << BSCIF_BOD33LEVEL_VAL_Pos)
#define BSCIF_BOD33LEVEL_VAL(value) (BSCIF_BOD33LEVEL_VAL_Msk & ((value) << BSCIF_BOD33LEVEL_VAL_Pos))
#define BSCIF_BOD33LEVEL_MASK       _U_(0x0000003F) /**< \brief (BSCIF_BOD33LEVEL) MASK Register */

/* -------- BSCIF_BOD33SAMPLING : (BSCIF Offset: 0x034) (R/W 32) BOD33 Sampling Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CEN:1;            /*!< bit:      0  Clock Enable                       */
    uint32_t CSSEL:1;          /*!< bit:      1  Clock Source Select                */
    uint32_t :6;               /*!< bit:  2.. 7  Reserved                           */
    uint32_t PSEL:4;           /*!< bit:  8..11  Prescaler Select                   */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BOD33SAMPLING_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_BOD33SAMPLING_OFFSET  0x034        /**< \brief (BSCIF_BOD33SAMPLING offset) BOD33 Sampling Control Register */
#define BSCIF_BOD33SAMPLING_RESETVALUE _U_(0x00000000); /**< \brief (BSCIF_BOD33SAMPLING reset_value) BOD33 Sampling Control Register */

#define BSCIF_BOD33SAMPLING_CEN_Pos 0            /**< \brief (BSCIF_BOD33SAMPLING) Clock Enable */
#define BSCIF_BOD33SAMPLING_CEN     (_U_(0x1) << BSCIF_BOD33SAMPLING_CEN_Pos)
#define BSCIF_BOD33SAMPLING_CSSEL_Pos 1            /**< \brief (BSCIF_BOD33SAMPLING) Clock Source Select */
#define BSCIF_BOD33SAMPLING_CSSEL   (_U_(0x1) << BSCIF_BOD33SAMPLING_CSSEL_Pos)
#define BSCIF_BOD33SAMPLING_PSEL_Pos 8            /**< \brief (BSCIF_BOD33SAMPLING) Prescaler Select */
#define BSCIF_BOD33SAMPLING_PSEL_Msk (_U_(0xF) << BSCIF_BOD33SAMPLING_PSEL_Pos)
#define BSCIF_BOD33SAMPLING_PSEL(value) (BSCIF_BOD33SAMPLING_PSEL_Msk & ((value) << BSCIF_BOD33SAMPLING_PSEL_Pos))
#define BSCIF_BOD33SAMPLING_MASK    _U_(0x00000F03) /**< \brief (BSCIF_BOD33SAMPLING) MASK Register */

/* -------- BSCIF_BOD18CTRL : (BSCIF Offset: 0x038) (R/W 32) BOD18 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Enable                             */
    uint32_t HYST:1;           /*!< bit:      1  BOD Hysteresis                     */
    uint32_t :6;               /*!< bit:  2.. 7  Reserved                           */
    uint32_t ACTION:2;         /*!< bit:  8.. 9  Action                             */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t MODE:1;           /*!< bit:     16  Operation modes                    */
    uint32_t :13;              /*!< bit: 17..29  Reserved                           */
    uint32_t FCD:1;            /*!< bit:     30  BOD Fuse Calibration Done          */
    uint32_t SFV:1;            /*!< bit:     31  BOD Control Register Store Final Value */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BOD18CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

