zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/bscif.h
#define BSCIF_BOD18CTRL_OFFSET      0x038        /**< \brief (BSCIF_BOD18CTRL offset) BOD18 Control Register */
#define BSCIF_BOD18CTRL_RESETVALUE  _U_(0x00000000); /**< \brief (BSCIF_BOD18CTRL reset_value) BOD18 Control Register */

#define BSCIF_BOD18CTRL_EN_Pos      0            /**< \brief (BSCIF_BOD18CTRL) Enable */
#define BSCIF_BOD18CTRL_EN          (_U_(0x1) << BSCIF_BOD18CTRL_EN_Pos)
#define BSCIF_BOD18CTRL_HYST_Pos    1            /**< \brief (BSCIF_BOD18CTRL) BOD Hysteresis */
#define BSCIF_BOD18CTRL_HYST        (_U_(0x1) << BSCIF_BOD18CTRL_HYST_Pos)
#define BSCIF_BOD18CTRL_ACTION_Pos  8            /**< \brief (BSCIF_BOD18CTRL) Action */
#define BSCIF_BOD18CTRL_ACTION_Msk  (_U_(0x3) << BSCIF_BOD18CTRL_ACTION_Pos)
#define BSCIF_BOD18CTRL_ACTION(value) (BSCIF_BOD18CTRL_ACTION_Msk & ((value) << BSCIF_BOD18CTRL_ACTION_Pos))
#define BSCIF_BOD18CTRL_MODE_Pos    16           /**< \brief (BSCIF_BOD18CTRL) Operation modes */
#define BSCIF_BOD18CTRL_MODE        (_U_(0x1) << BSCIF_BOD18CTRL_MODE_Pos)
#define BSCIF_BOD18CTRL_FCD_Pos     30           /**< \brief (BSCIF_BOD18CTRL) BOD Fuse Calibration Done */
#define BSCIF_BOD18CTRL_FCD         (_U_(0x1) << BSCIF_BOD18CTRL_FCD_Pos)
#define BSCIF_BOD18CTRL_SFV_Pos     31           /**< \brief (BSCIF_BOD18CTRL) BOD Control Register Store Final Value */
#define BSCIF_BOD18CTRL_SFV         (_U_(0x1) << BSCIF_BOD18CTRL_SFV_Pos)
#define BSCIF_BOD18CTRL_MASK        _U_(0xC0010303) /**< \brief (BSCIF_BOD18CTRL) MASK Register */

/* -------- BSCIF_BOD18LEVEL : (BSCIF Offset: 0x03C) (R/W 32) BOD18 Level Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VAL:6;            /*!< bit:  0.. 5  BOD Value                          */
    uint32_t :25;              /*!< bit:  6..30  Reserved                           */
    uint32_t RANGE:1;          /*!< bit:     31  BOD Threshold Range                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BOD18LEVEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_BOD18LEVEL_OFFSET     0x03C        /**< \brief (BSCIF_BOD18LEVEL offset) BOD18 Level Register */
#define BSCIF_BOD18LEVEL_RESETVALUE _U_(0x00000000); /**< \brief (BSCIF_BOD18LEVEL reset_value) BOD18 Level Register */

#define BSCIF_BOD18LEVEL_VAL_Pos    0            /**< \brief (BSCIF_BOD18LEVEL) BOD Value */
#define BSCIF_BOD18LEVEL_VAL_Msk    (_U_(0x3F) << BSCIF_BOD18LEVEL_VAL_Pos)
#define BSCIF_BOD18LEVEL_VAL(value) (BSCIF_BOD18LEVEL_VAL_Msk & ((value) << BSCIF_BOD18LEVEL_VAL_Pos))
#define BSCIF_BOD18LEVEL_RANGE_Pos  31           /**< \brief (BSCIF_BOD18LEVEL) BOD Threshold Range */
#define BSCIF_BOD18LEVEL_RANGE      (_U_(0x1) << BSCIF_BOD18LEVEL_RANGE_Pos)
#define BSCIF_BOD18LEVEL_MASK       _U_(0x8000003F) /**< \brief (BSCIF_BOD18LEVEL) MASK Register */

/* -------- BSCIF_VREGCR : (BSCIF Offset: 0x044) (R/W 32) Voltage Regulator Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DIS:1;            /*!< bit:      0  Voltage Regulator disable          */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t SSG:1;            /*!< bit:      8  Spread Spectrum Generator Enable   */
    uint32_t SSW:1;            /*!< bit:      9  Stop Switching                     */
    uint32_t SSWEVT:1;         /*!< bit:     10  Stop Switching On Event Enable     */
    uint32_t :20;              /*!< bit: 11..30  Reserved                           */
    uint32_t SFV:1;            /*!< bit:     31  Store Final Value                  */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_VREGCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_VREGCR_OFFSET         0x044        /**< \brief (BSCIF_VREGCR offset) Voltage Regulator Configuration Register */
#define BSCIF_VREGCR_RESETVALUE     _U_(0x00000000); /**< \brief (BSCIF_VREGCR reset_value) Voltage Regulator Configuration Register */

#define BSCIF_VREGCR_DIS_Pos        0            /**< \brief (BSCIF_VREGCR) Voltage Regulator disable */
#define BSCIF_VREGCR_DIS            (_U_(0x1) << BSCIF_VREGCR_DIS_Pos)
#define BSCIF_VREGCR_SSG_Pos        8            /**< \brief (BSCIF_VREGCR) Spread Spectrum Generator Enable */
#define BSCIF_VREGCR_SSG            (_U_(0x1) << BSCIF_VREGCR_SSG_Pos)
#define BSCIF_VREGCR_SSW_Pos        9            /**< \brief (BSCIF_VREGCR) Stop Switching */
#define BSCIF_VREGCR_SSW            (_U_(0x1) << BSCIF_VREGCR_SSW_Pos)
#define BSCIF_VREGCR_SSWEVT_Pos     10           /**< \brief (BSCIF_VREGCR) Stop Switching On Event Enable */
#define BSCIF_VREGCR_SSWEVT         (_U_(0x1) << BSCIF_VREGCR_SSWEVT_Pos)
#define BSCIF_VREGCR_SFV_Pos        31           /**< \brief (BSCIF_VREGCR) Store Final Value */
#define BSCIF_VREGCR_SFV            (_U_(0x1) << BSCIF_VREGCR_SFV_Pos)
#define BSCIF_VREGCR_MASK           _U_(0x80000701) /**< \brief (BSCIF_VREGCR) MASK Register */

/* -------- BSCIF_VREGNCSR : (BSCIF Offset: 0x04C) (R/W 32) Normal Mode Control and Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_VREGNCSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_VREGNCSR_OFFSET       0x04C        /**< \brief (BSCIF_VREGNCSR offset) Normal Mode Control and Status Register */
#define BSCIF_VREGNCSR_RESETVALUE   _U_(0x00000000); /**< \brief (BSCIF_VREGNCSR reset_value) Normal Mode Control and Status Register */

#define BSCIF_VREGNCSR_MASK         _U_(0x00000000) /**< \brief (BSCIF_VREGNCSR) MASK Register */

/* -------- BSCIF_VREGLPCSR : (BSCIF Offset: 0x050) (R/W 32) LP Mode Control and Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_VREGLPCSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_VREGLPCSR_OFFSET      0x050        /**< \brief (BSCIF_VREGLPCSR offset) LP Mode Control and Status Register */
#define BSCIF_VREGLPCSR_RESETVALUE  _U_(0x00000000); /**< \brief (BSCIF_VREGLPCSR reset_value) LP Mode Control and Status Register */

