zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/bscif.h
#define BSCIF_VREGLPCSR_MASK        _U_(0x00000000) /**< \brief (BSCIF_VREGLPCSR) MASK Register */

/* -------- BSCIF_RC1MCR : (BSCIF Offset: 0x058) (R/W 32) 1MHz RC Clock Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CLKOE:1;          /*!< bit:      0  1MHz RC Osc Clock Output Enable    */
    uint32_t :6;               /*!< bit:  1.. 6  Reserved                           */
    uint32_t FCD:1;            /*!< bit:      7  Flash Calibration Done             */
    uint32_t CLKCAL:5;         /*!< bit:  8..12  1MHz RC Osc Calibration            */
    uint32_t :19;              /*!< bit: 13..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_RC1MCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_RC1MCR_OFFSET         0x058        /**< \brief (BSCIF_RC1MCR offset) 1MHz RC Clock Configuration Register */
#define BSCIF_RC1MCR_RESETVALUE     _U_(0x00000F00); /**< \brief (BSCIF_RC1MCR reset_value) 1MHz RC Clock Configuration Register */

#define BSCIF_RC1MCR_CLKOE_Pos      0            /**< \brief (BSCIF_RC1MCR) 1MHz RC Osc Clock Output Enable */
#define BSCIF_RC1MCR_CLKOE          (_U_(0x1) << BSCIF_RC1MCR_CLKOE_Pos)
#define BSCIF_RC1MCR_FCD_Pos        7            /**< \brief (BSCIF_RC1MCR) Flash Calibration Done */
#define BSCIF_RC1MCR_FCD            (_U_(0x1) << BSCIF_RC1MCR_FCD_Pos)
#define BSCIF_RC1MCR_CLKCAL_Pos     8            /**< \brief (BSCIF_RC1MCR) 1MHz RC Osc Calibration */
#define BSCIF_RC1MCR_CLKCAL_Msk     (_U_(0x1F) << BSCIF_RC1MCR_CLKCAL_Pos)
#define BSCIF_RC1MCR_CLKCAL(value)  (BSCIF_RC1MCR_CLKCAL_Msk & ((value) << BSCIF_RC1MCR_CLKCAL_Pos))
#define BSCIF_RC1MCR_MASK           _U_(0x00001F81) /**< \brief (BSCIF_RC1MCR) MASK Register */

/* -------- BSCIF_BGCR : (BSCIF Offset: 0x05C) (R/W 32) Bandgap Calibration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BGCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_BGCR_OFFSET           0x05C        /**< \brief (BSCIF_BGCR offset) Bandgap Calibration Register */
#define BSCIF_BGCR_RESETVALUE       _U_(0x00000000); /**< \brief (BSCIF_BGCR reset_value) Bandgap Calibration Register */

#define BSCIF_BGCR_MASK             _U_(0x00000000) /**< \brief (BSCIF_BGCR) MASK Register */

/* -------- BSCIF_BGCTRL : (BSCIF Offset: 0x060) (R/W 32) Bandgap Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADCISEL:2;        /*!< bit:  0.. 1  ADC Input Selection                */
    uint32_t :6;               /*!< bit:  2.. 7  Reserved                           */
    uint32_t TSEN:1;           /*!< bit:      8  Temperature Sensor Enable          */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_BGCTRL_OFFSET         0x060        /**< \brief (BSCIF_BGCTRL offset) Bandgap Control Register */
#define BSCIF_BGCTRL_RESETVALUE     _U_(0x00000000); /**< \brief (BSCIF_BGCTRL reset_value) Bandgap Control Register */

#define BSCIF_BGCTRL_ADCISEL_Pos    0            /**< \brief (BSCIF_BGCTRL) ADC Input Selection */
#define BSCIF_BGCTRL_ADCISEL_Msk    (_U_(0x3) << BSCIF_BGCTRL_ADCISEL_Pos)
#define BSCIF_BGCTRL_ADCISEL(value) (BSCIF_BGCTRL_ADCISEL_Msk & ((value) << BSCIF_BGCTRL_ADCISEL_Pos))
#define   BSCIF_BGCTRL_ADCISEL_DIS_Val    _U_(0x0)   /**< \brief (BSCIF_BGCTRL)  */
#define   BSCIF_BGCTRL_ADCISEL_VTEMP_Val  _U_(0x1)   /**< \brief (BSCIF_BGCTRL)  */
#define   BSCIF_BGCTRL_ADCISEL_VREF_Val   _U_(0x2)   /**< \brief (BSCIF_BGCTRL)  */
#define BSCIF_BGCTRL_ADCISEL_DIS    (BSCIF_BGCTRL_ADCISEL_DIS_Val  << BSCIF_BGCTRL_ADCISEL_Pos)
#define BSCIF_BGCTRL_ADCISEL_VTEMP  (BSCIF_BGCTRL_ADCISEL_VTEMP_Val << BSCIF_BGCTRL_ADCISEL_Pos)
#define BSCIF_BGCTRL_ADCISEL_VREF   (BSCIF_BGCTRL_ADCISEL_VREF_Val << BSCIF_BGCTRL_ADCISEL_Pos)
#define BSCIF_BGCTRL_TSEN_Pos       8            /**< \brief (BSCIF_BGCTRL) Temperature Sensor Enable */
#define BSCIF_BGCTRL_TSEN           (_U_(0x1) << BSCIF_BGCTRL_TSEN_Pos)
#define BSCIF_BGCTRL_MASK           _U_(0x00000103) /**< \brief (BSCIF_BGCTRL) MASK Register */

/* -------- BSCIF_BGSR : (BSCIF Offset: 0x064) (R/  32) Bandgap Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BGBUFRDY:8;       /*!< bit:  0.. 7  Bandgap Buffer Ready               */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t BGRDY:1;          /*!< bit:     16  Bandgap Voltage Reference Ready    */
    uint32_t LPBGRDY:1;        /*!< bit:     17  Low Power Bandgap Voltage Reference Ready */
    uint32_t VREF:2;           /*!< bit: 18..19  Voltage Reference Used by the System */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_BGSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_BGSR_OFFSET           0x064        /**< \brief (BSCIF_BGSR offset) Bandgap Status Register */
#define BSCIF_BGSR_RESETVALUE       _U_(0x00000000); /**< \brief (BSCIF_BGSR reset_value) Bandgap Status Register */

#define BSCIF_BGSR_BGBUFRDY_Pos     0            /**< \brief (BSCIF_BGSR) Bandgap Buffer Ready */
#define BSCIF_BGSR_BGBUFRDY_Msk     (_U_(0xFF) << BSCIF_BGSR_BGBUFRDY_Pos)
#define BSCIF_BGSR_BGBUFRDY(value)  (BSCIF_BGSR_BGBUFRDY_Msk & ((value) << BSCIF_BGSR_BGBUFRDY_Pos))
#define   BSCIF_BGSR_BGBUFRDY_FLASH_Val   _U_(0x1)   /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_PLL_Val     _U_(0x2)   /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_VREG_Val    _U_(0x4)   /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_BUFRR_Val   _U_(0x8)   /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_ADC_Val     _U_(0x10)   /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_LCD_Val     _U_(0x20)   /**< \brief (BSCIF_BGSR)  */
#define BSCIF_BGSR_BGBUFRDY_FLASH   (BSCIF_BGSR_BGBUFRDY_FLASH_Val << BSCIF_BGSR_BGBUFRDY_Pos)
#define BSCIF_BGSR_BGBUFRDY_PLL     (BSCIF_BGSR_BGBUFRDY_PLL_Val   << BSCIF_BGSR_BGBUFRDY_Pos)
#define BSCIF_BGSR_BGBUFRDY_VREG    (BSCIF_BGSR_BGBUFRDY_VREG_Val  << BSCIF_BGSR_BGBUFRDY_Pos)
#define BSCIF_BGSR_BGBUFRDY_BUFRR   (BSCIF_BGSR_BGBUFRDY_BUFRR_Val << BSCIF_BGSR_BGBUFRDY_Pos)
#define BSCIF_BGSR_BGBUFRDY_ADC     (BSCIF_BGSR_BGBUFRDY_ADC_Val   << BSCIF_BGSR_BGBUFRDY_Pos)
#define BSCIF_BGSR_BGBUFRDY_LCD     (BSCIF_BGSR_BGBUFRDY_LCD_Val   << BSCIF_BGSR_BGBUFRDY_Pos)
#define BSCIF_BGSR_BGRDY_Pos        16           /**< \brief (BSCIF_BGSR) Bandgap Voltage Reference Ready */
#define BSCIF_BGSR_BGRDY            (_U_(0x1) << BSCIF_BGSR_BGRDY_Pos)
#define BSCIF_BGSR_LPBGRDY_Pos      17           /**< \brief (BSCIF_BGSR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_BGSR_LPBGRDY          (_U_(0x1) << BSCIF_BGSR_LPBGRDY_Pos)
#define BSCIF_BGSR_VREF_Pos         18           /**< \brief (BSCIF_BGSR) Voltage Reference Used by the System */
#define BSCIF_BGSR_VREF_Msk         (_U_(0x3) << BSCIF_BGSR_VREF_Pos)
#define BSCIF_BGSR_VREF(value)      (BSCIF_BGSR_VREF_Msk & ((value) << BSCIF_BGSR_VREF_Pos))
#define BSCIF_BGSR_MASK             _U_(0x000F00FF) /**< \brief (BSCIF_BGSR) MASK Register */

